# Yêu Cầu
1. Clean the names of columns to lowercase and remove any empty columns if necessary.
2. Change the date column to the same format ‘YYYY-MM-DD’.
3. Change the name column to the title case (e.g: Jason Mraz).
4. Make a new “email” column with the form: {last_name}.{first_name}.{id}@yourcompany.com
5. Change the phone number column to the format “84……”
6. Find any duplicated ID and remove those who join later.
7. Filter those who join since 2019 and export to a csv file, file name “emp_{report_date}.csv” with report_date = today.

# Add File

In [751]:
import pandas as pd
from datetime import datetime
from datetime import time
from datetime import date

In [752]:
df = pd.read_csv('data_source_clean/messy.xlsx - test.csv')

### Clean the names of columns to lowercase and remove any empty columns if necessary

In [753]:
df.columns

Index(['CUst ID', '  JOIN% DATE', 'Unnamed: 2', 'mobiles', '  FLL NAM'], dtype='object')

In [754]:
df.rename(columns={
                    'CUst ID':'customer id'
                    , '  JOIN% DATE' :'date'
                    , 'mobiles' : 'phone'
                    , '  FLL NAM' : 'full name'
                  } , inplace=True
          )

In [755]:
df.drop(columns=['Unnamed: 2'] , inplace=True)

### Change the name column to the title case (e.g: Jason Mraz)

In [756]:
df['full name'] = df['full name'].str.title()

### Change the date column to the same format ‘YYYY-MM-DD’.

In [757]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer id  100 non-null    int64
 1   date         100 non-null    object
 2   phone        100 non-null    int64
 3   full name    100 non-null    object
dtypes: int64(2), object(2)
memory usage: 3.2+ KB

### Change the date column to the same format ‘YYYY-MM-DD’

In [758]:
def transfer_datetime(x):
    d = x.split(' ')
    if len(d) > 1:
        return pd.to_datetime(d[0] , format='%Y-%m-%d') 
    elif '/' in x:
        return pd.to_datetime(x, format='%d/%m/%y')
    elif len(x) == 8:
        return pd.to_datetime(x, format='%Y%m%d')
    else:
        return print(x)

In [759]:
df['date'] = df['date'].apply(transfer_datetime)

### Change the phone number column to the format “84……”

In [760]:
df['phone'] = df['phone'].astype(str)

In [767]:
def clean_phone(x):
    if x[0:2] != '84':
        return '84' + x
    else:
        return x

In [768]:
df['phone'] = df['phone'].apply(clean_phone)

### Make a new “email” column with the form: {last_name}.{first_name}.{id}@yourcompany.com

In [784]:
df.sample(10)

    customer id       date         phone         full name
42           43 2018-10-18  841288318360        Marta Wong
10           11 2019-07-10   84973180839       Otis Arnold
5            21 2018-06-02   84339769174   Roger Callender
36           37 2018-03-18   84334929973  Joseph Nebergall
28           29 2018-02-25   84971748428         Tom Faust
48           49 2018-07-27   84333827249      Bok Mcmullen
65           66 2019-09-12   84869366677  Florence Luallen
44           45 2018-08-03  841285237717    Michael Fields
58           25 2019-07-16   84867037738    Arthur Branham
25           26 2017-08-07   84966042581   Charles Garnand

In [810]:
df['email'] = df['customer id'].astype(str) + ' ' + df['full name']

In [828]:
def format_email (x):
    n = x.split(' ')
    if len(n) ==3:
        return n[1] + '.' + n[2] + '.' + n[0] + '@yourcompany.com'
    else:
        pass

In [832]:
df['email'] = df['email'].apply(format_email)

In [833]:
df.sample(10)

,customer id,date,phone,full name,email
70,71,2018-02-02,841269552874,Lorretta Douthitt,Lorretta.Douthitt.71@yourcompany.com
32,33,2019-07-23,84974404339,Lawrence Cummings,Lawrence.Cummings.33@yourcompany.com
92,58,2018-12-27,841266030416,Miguel Budreau,Miguel.Budreau.58@yourcompany.com
1,2,2018-10-09,84973444062,Andrew Jimenez,Andrew.Jimenez.2@yourcompany.com
84,85,2018-07-29,841261554976,Robert Streater,Robert.Streater.85@yourcompany.com
40,41,2019-01-01,841267025689,Elizabeth Herrington,Elizabeth.Herrington.41@yourcompany.com
20,21,2017-08-30,841227138894,Angie Davis,Angie.Davis.21@yourcompany.com
57,24,2018-06-05,84341879989,Janet Doughty,Janet.Doughty.24@yourcompany.com
65,66,2019-09-12,84869366677,Florence Luallen,Florence.Luallen.66@yourcompany.com
48,49,2018-07-27,84333827249,Bok Mcmullen,Bok.Mcmullen.49@yourcompany.com

### Find any duplicated ID and remove those who join later.

In [843]:
df.drop_duplicates('customer id' , keep = 'first' , inplace=True)

In [844]:
df.loc[df['customer id'].duplicated()]

Empty DataFrame
Columns: [customer id, date, phone, full name, email]
Index: []

### Filter those who join since 2019 and export to a csv file, file name “emp_{report_date}.csv” with report_date = today.

In [847]:
df_19  = df.loc[df['date'].dt.year == 2019]

In [850]:
df_19.to_csv('emp_{}.csv'.format(date.today()))